function [X,Y] = ExplicitRungeKuttaMethod(F, state, x_0, y_0, h, rightBorder)
    switch state %Число этапов и выбор метода
        case 1 %Метод Эйлера
            A = 0;
            B = 1;
            C = 0;
        case 2 %Метод Хойна
            A = [0 0; 1 0];
            B = [0.5 0.5];
            C = [0 1];
        case 3 %Метод Симпсона
            A = [0 0 0; 0.5 0 0; -1 2 0];
            B = [1/6 2/3 1/6];
            C = [0 0.5 1];
        case 4 %Метод Рунге-Кутты
            A = [0 0 0 0; 0.5 0 0 0; 0 0.5 0 0; 0 0 1 0];
            B = [1/6 1/3 1/3 1/6];
            C = [0 0.5 0.5 1];
    end
    
    %Определяем начальные условия
    v = 0; X = [];
    v = v + 1;
    X(v) = (x_0);
    Y = y_0;
    
    while (x_0 < rightBorder)
%%%%%%%%%%% Высчитываем коэффициенты k %%%%%%%%%%%%%%
        Y_1 = Step (F, A, B, C, h, x_0, y_0);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%       
        x_0 = x_0 + h;
        y_0 = Y_1;
        
        v = v + 1;
        X(v) = (x_0);
        Y = [Y, y_0];
    end
   
end

