% f1 = @(x,y) 2*x*(y(2))^(1/2.5)*(y(4));    %Задание из отчета
% f2 = @(x,y) 5*x*exp(2.5*(y(3)+3))*(y(4));
% f3 = @(x,y) 2*x*(y(4));
% f4 = @(x,y) -2*x*log(y(1));
% F = {f1 f2 f3 f4};
% x_0 = 0;
% y_0 = [1; 1; -3; 1];
% % f1 = @(x,y) -0.04*y(1) + 10^4 * y(2) * y(3);    %Описание хим. реакций
% % f2 = @(x,y) 0.04*y(1) - 10^4 * y(2) * y(3) - 3*10^7* y(2)*y(2);
% % f3 = @(x,y) 3*10^7* y(2)*y(2);
% % F = {f1 f2 f3};
% % x_0 = 0;
% % y_0 = [1; 0; 0];
f = @(x,y) -50*(y - cos(x));          %Простой пример жесткой задачи
F = {f};
x_0 = 0;
y_0 = 0;
% % f1 = @(x,y) y(2);               %уравнение Ван-Дер Поля
% % f2 = @(x,y) 100*((1-y(1)*y(1)) * y(2) - y(1));
% % F = {f1 f2};
% % x_0 = 0;
% % y_0 = [2; 0];
% f1 = @(x,y) 77.27*(y(2) + y(1)*(1 - 8.375*10^(-6)* y(1) - y(2))); %Орегонатор
% f2 = @(x,y) (1/77.27) * (y(3) - (1 + y(1))* y(2));
% f3 = @(x,y) 0.161* (y(1)-y(3));
% F = {f1,f2,f3};
% x_0 = 0;
% y_0 = [1; 1; 1];
RightBorder = 2.4;
h = 2/50;
tol = 10^(-4);

%[X,Y] = ExplicitRungeKuttaMethod (F, 1, x_0, y_0, h, RightBorder);
[X,Y] = AutoStep_ERKMethod (F, 3, x_0, y_0, h, RightBorder, tol);

figure
hold on
grid on
plot (X,(Y(1,:)),'-o');
% plot (X,Y(2,:),'-o');
% plot (X,Y(3,:),'o');
% plot (X,Y(4,:),'o');
%ОТВЕТЫ
% x=linspace (0,5,1000);
% plot (x, exp(sin(x.^2)));
% plot (x, exp(2.5*sin(x.^2)));
% plot (x, (sin(x.^2)-3));
% plot (x, cos(x.^2));
